In [32]:
import pandas as pd
import numpy as np

In [33]:
stock = {'AMZN': pd.Series([346.15,0.59,459,0.52,589.8,158.88],
                           index = ['Closing price','EPS','Shares Outstanding(M)', 
                                  'Beta', 'P/E','Market Cap(B)']),
         'GOOG': pd.Series([1133.43,36.05,335.83,0.87,31.44,380.64],
                            index = ['Closing price','EPS','Shares Outstanding(M)',
                                  'Beta','P/E','Market Cap(B)']),
         'FB': pd.Series([61.48,0.59,2450,104.93,150.92],
                            index = ['Closing price','EPS','Shares Outstanding(M)',
                                  'P/E', 'Market Cap(B)']),
         'YHOO': pd.Series([34.90,1.27,1010,27.48,0.66,35.36],
                            index=['Closing price','EPS','Shares Outstanding(M)',
                                  'P/E','Beta', 'Market Cap(B)']),
         'TWTR':pd.Series([65.25,-0.3,555.2,36.23],
                            index=['Closing price','EPS','Shares Outstanding(M)',
                                  'Market Cap(B)']),
         'AAPL':pd.Series([501.53,40.32,892.45,12.44,447.59,0.84],
                            index=['Closing price','EPS','Shares Outstanding(M)','P/E',
                                  'Market Cap(B)','Beta'])}

In [34]:
stock_df = pd.DataFrame(stock)

In [35]:
stock_df

                         AMZN     GOOG       FB     YHOO    TWTR    AAPL
Beta                     0.52     0.87      NaN     0.66     NaN    0.84
Closing price          346.15  1133.43    61.48    34.90   65.25  501.53
EPS                      0.59    36.05     0.59     1.27   -0.30   40.32
Market Cap(B)          158.88   380.64   150.92    35.36   36.23  447.59
P/E                    589.80    31.44   104.93    27.48     NaN   12.44
Shares Outstanding(M)  459.00   335.83  2450.00  1010.00  555.20  892.45

In [36]:
 stock_df = pd.DataFrame(stock, 
                        index = ['Closing price', 
                                'EPS',
                                'Shares Outstanding',
                                'P/E',
                                'Market Cap(B)',
                                'Beta'])

In [37]:
stock_df

                      AMZN     GOOG      FB   YHOO   TWTR    AAPL
Closing price       346.15  1133.43   61.48  34.90  65.25  501.53
EPS                   0.59    36.05    0.59   1.27  -0.30   40.32
Shares Outstanding     NaN      NaN     NaN    NaN    NaN     NaN
P/E                 589.80    31.44  104.93  27.48    NaN   12.44
Market Cap(B)       158.88   380.64  150.92  35.36  36.23  447.59
Beta                  0.52     0.87     NaN   0.66    NaN    0.84

In [38]:
 stock_df = pd.DataFrame(stock, 
                        index = ['Closing price', 
                                'EPS',
                                'Shares Outstanding',
                                'P/E',
                                'Market Cap(B)',
                                'Beta'],
                        columns = ['FB', 'TWTR', 'SCNW'])

In [39]:
stock_df

                        FB   TWTR SCNW
Closing price        61.48  65.25  NaN
EPS                   0.59  -0.30  NaN
Shares Outstanding     NaN    NaN  NaN
P/E                 104.93    NaN  NaN
Market Cap(B)       150.92  36.23  NaN
Beta                   NaN    NaN  NaN

In [40]:
stock_df.index

Index(['Closing price', 'EPS', 'Shares Outstanding', 'P/E', 'Market Cap(B)',
       'Beta'],
      dtype='object')

In [41]:
stock_df.columns

Index(['FB', 'TWTR', 'SCNW'], dtype='object')

## Operações com DataFrame

In [42]:
Quadro_Medalhas_Rio_2016 = {
    'USA' : {'Ouro':46, 'Prata':37, 'Bronze':38},
    'China':{'Ouro':26, 'Prata':18, 'Bronze':26},
    'Britain':{'Ouro':27, 'Prata':23, 'Bronze':17},
    'Russe':{'Ouro':19, 'Prata':18, 'Bronze':19},
    'Germany':{'Ouro':17, 'Prata':10, 'Bronze':15}}

In [43]:
Rio_2016 = pd.DataFrame.from_dict(Quadro_Medalhas_Rio_2016)

In [44]:
Rio_2016

        USA  China  Britain  Russe  Germany
Ouro     46     26       27     19       17
Prata    37     18       23     18       10
Bronze   38     26       17     19       15

In [45]:
type(Rio_2016)

pandas.core.frame.DataFrame

In [46]:
Medalhas_China = Rio_2016['China']

In [47]:
Medalhas_China

Ouro      26
Prata     18
Bronze    26
Name: China, dtype: int64

In [48]:
 Rio_2016.Russe

Ouro      19
Prata     18
Bronze    19
Name: Russe, dtype: int64

In [49]:
Rio_2016[['Russe','Germany']]

        Russe  Germany
Ouro       19       17
Prata      18       10
Bronze     19       15

In [50]:
Rio_2016.get('Germany')

Ouro      17
Prata     10
Bronze    15
Name: Germany, dtype: int64

In [51]:
Rio_2016

        USA  China  Britain  Russe  Germany
Ouro     46     26       27     19       17
Prata    37     18       23     18       10
Bronze   38     26       17     19       15

## Slicing

In [55]:
Rio_2016[:2]

       USA  China  Britain  Russe  Germany
Ouro    46     26       27     19       17
Prata   37     18       23     18       10

In [56]:
Rio_2016[2:]

        USA  China  Britain  Russe  Germany
Bronze   38     26       17     19       15

In [57]:
Rio_2016[::2]

        USA  China  Britain  Russe  Germany
Ouro     46     26       27     19       17
Bronze   38     26       17     19       15

In [59]:
Rio_2016[::-1]

        USA  China  Britain  Russe  Germany
Bronze   38     26       17     19       15
Prata    37     18       23     18       10
Ouro     46     26       27     19       17

In [60]:
Rio_2016

        USA  China  Britain  Russe  Germany
Ouro     46     26       27     19       17
Prata    37     18       23     18       10
Bronze   38     26       17     19       15

## Slicing por indexação

In [61]:
Rio_2016.loc['Ouro']

USA        46
China      26
Britain    27
Russe      19
Germany    17
Name: Ouro, dtype: int64

In [62]:
Rio_2016.loc[:,'USA']

Ouro      46
Prata     37
Bronze    38
Name: USA, dtype: int64

In [63]:
Rio_2016.loc['Prata','China']

18

In [64]:
Rio_2016.loc['Prata']['China']

18

In [68]:
Rio_2016.loc['Prata']

USA        37
China      18
Britain    23
Russe      18
Germany    10
Name: Prata, dtype: int64

In [69]:
Rio_2016.loc['Ouro'] > 20

USA         True
China       True
Britain     True
Russe      False
Germany    False
Name: Ouro, dtype: bool

In [70]:
Rio_2016.loc[:,Rio_2016.loc['Ouro'] > 20]

        USA  China  Britain
Ouro     46     26       27
Prata    37     18       23
Bronze   38     26       17

In [71]:
Rio_2016.loc['Prata'] > 20

USA         True
China      False
Britain     True
Russe      False
Germany    False
Name: Prata, dtype: bool

In [72]:
Rio_2016.iloc[:2]

       USA  China  Britain  Russe  Germany
Ouro    46     26       27     19       17
Prata   37     18       23     18       10

In [73]:
Rio_2016.iloc[2,0:2]

USA      38
China    26
Name: Bronze, dtype: int64

In [74]:
Rio_2016.iloc[2:3,:]

        USA  China  Britain  Russe  Germany
Bronze   38     26       17     19       15

In [75]:
Rio_2016.iloc[1:]

        USA  China  Britain  Russe  Germany
Prata    37     18       23     18       10
Bronze   38     26       17     19       15

In [76]:
Rio_2016.iloc[2,0]

38

## Removendo um membro do dataframe

In [77]:
del Rio_2016['USA']

In [78]:
Rio_2016

        China  Britain  Russe  Germany
Ouro       26       27     19       17
Prata      18       23     18       10
Bronze     26       17     19       15

## Inserindo um membro

In [79]:
Rio_2016.insert(0,'Brasil', (7,6,6))

In [80]:
Rio_2016

        Brasil  China  Britain  Russe  Germany
Ouro         7     26       27     19       17
Prata        6     18       23     18       10
Bronze       6     26       17     19       15

## Outras operações matemáticas

In [81]:
Rio_2016.describe()

         Brasil      China    Britain      Russe    Germany
count  3.000000   3.000000   3.000000   3.000000   3.000000
mean   6.333333  23.333333  22.333333  18.666667  14.000000
std    0.577350   4.618802   5.033223   0.577350   3.605551
min    6.000000  18.000000  17.000000  18.000000  10.000000
25%    6.000000  22.000000  20.000000  18.500000  12.500000
50%    6.000000  26.000000  23.000000  19.000000  15.000000
75%    6.500000  26.000000  25.000000  19.000000  16.000000
max    7.000000  26.000000  27.000000  19.000000  17.000000